/**
 * Created by Administrator on 15-11-18.
 */
public class tfhtest {
    public static void main(String[] args) {
        tfh a = new tfh();
//        a.X100(106.796481,26.761254);
//        a.X100(108.796481,23.761254);
//        a.X25old(110.796481,23.761254);//0,1
//        a.X25old(113.796481,23.761254);//1,1
//        a.X25(110.796481,20.761254);//0,0
//        a.X25(113.796481,20.761254);//1,0
//        System.out.println("x3============");
//        a.XB(110.796481,23.761254);//0,1 (001001)
//        a.XB(113.796481,23.761254);//1,1 (001002)
//        a.XB(110.796481,20.761254);//0,0 (002001)
//        a.XB(113.796481,20.761254);//1,0 (002002)
//        System.out.println("xB============");
//        a.XB(117.796481,39.761254);//1,0 (002002)
//        a.XB(114.796481,39.761254);//1,0 (002002)
//        a.XB(117.796481,37.761254);//1,0 (002002)
//        a.XB(114.796481,37.761254);//1,0 (002002)
//          System.out.println("xC============");
//        a.XC(114.796481,39.761254);//1,0 (002002)
//        a.XC(117.796481,37.761254);//1,0 (002002)
//        a.XC(114.796481,39.761254);//1,0 (002002)
//        a.XC(117.796481,37.761254);//1,0 (002002)

        System.out.println("xD============");
        a.XD(114.796481, 39.761254);//1,0 (002002)
        a.XD(117.796481,37.761254);//1,0 (002002)
        a.XD(114.796481,39.761254);//1,0 (002002)
        a.XD(117.796481,37.761254);//1,0 (002002)
        ConvertLatlng convert=new ConvertLatlng();
        double latlng1=convert.convertToDecimal(39,22,39);
        double latlng2=convert.convertToDecimal(114,33,45);
        System.out.println(latlng1);
        System.out.println(latlng2);
         a.XD(latlng2,latlng1);//1,0 (002002)
         a.XE(latlng2, latlng1);//1,0 (002002)
         a.XF(latlng2, latlng1);//1,0 (002002)
         a.XG(latlng2, latlng1);//X1,0 (002002)
//        （ ）------表示商取余；
//        [  ] ------表示取整；
//        c -------所求比例尺地形图在1：1000 000地形图图号后的行号；
//        d--------所求比例尺地形图在1: 1000 000地形图图号后的列号；
//        --------图幅内某点的经度或图幅西南图廓点的经度；
//        -------图幅内某点的纬度或图幅西南图廓点的纬度；
//        -------所求比例尺地形图分幅的经差；
//        -------所求比例尺地形图分幅的纬差。







//         a.XX(latlng2, latlng1);//1,0 (002002)

//        a.XB(117.30,38);//1,0
//        a.XB(114.30,38);//1,0
//        a.X3(113.796481,20.761254);//1,0
//        a.X3(113.796481,20.761254);//1,0
    }

}
